Masmiseim36/iMXRT/targets/iMXRText/devices/iMXRT1180/startup_MIMXRT1185_cm7.s
ISR_HANDLER2 LPIT3                                // vLPIT3_IRQHandler                                 - LPIT3 interrupt
ISR_HANDLER2 LPTMR3                               // vLPTMR3_IRQHandler                                - LPTMR3 interrupt
ISR_HANDLER2 TMR4                                 // vTMR4_IRQHandler                                  - TMR4 interrupt
ISR_RESERVED                                      // vReserved168_IRQHandler                           - Reserved interrupt
ISR_HANDLER2 LPI2C6                               // vLPI2C6_IRQHandler                                - LPI2C6 interrupt
ISR_HANDLER2 SAI4                                 // vSAI4_IRQHandler                                  - SAI4 interrupt
ISR_HANDLER2 SPDIF                                // vSPDIF_IRQHandler                                 - SPDIF interrupt
ISR_RESERVED                                      // vReserved172_IRQHandler                           - Reserved interrupt
ISR_RESERVED                                      // vReserved173_IRQHandler                           - Reserved interrupt
ISR_RESERVED                                      // vReserved174_IRQHandler                           - Reserved interrupt
ISR_RESERVED                                      // vReserved175_IRQHandler                           - Reserved interrupt
ISR_HANDLER2 INTG_BOOTROM_DEBUG_CTRL              // vINTG_BOOTROM_DEBUG_CTRL_IRQHandler               - CM33, CM7, DAP access IRQ
ISR_HANDLER2 EDGELOCK_REQ1                        // vEDGELOCK_REQ1_IRQHandler                         - Edgelock reuqest 1 interrupt
ISR_HANDLER2 EDGELOCK_REQ2                        // vEDGELOCK_REQ2_IRQHandler                         - Edgelock reuqest 2 interrupt
ISR_HANDLER2 EDGELOCK_REQ3                        // vEDGELOCK_REQ3_IRQHandler                         - Edgelock reuqest 3 interrupt
ISR_HANDLER2 TMR3                                 // vTMR3_IRQHandler                                  - TMR3 interrupt
ISR_HANDLER2 JTAGC                                // vJTAGC_IRQHandler                                 - JTAGC SRC reset source
ISR_HANDLER2 M33_SYSRESET_REQ                     // vM33_SYSRESET_REQ_IRQHandler                      - CM33 SYSREQRST SRC reset source
ISR_HANDLER2 M33_LOCKUP                           // vM33_LOCKUP_IRQHandler                            - CM33 LOCKUP SRC reset source
ISR_HANDLER2 M7_SYSRESET_REQ                      // vM7_SYSRESET_REQ_IRQHandler                       - CM33 SYSREQRST SRC reset source
ISR_HANDLER2 M7_LOCKUP                            // vM7_LOCKUP_IRQHandler                             - CM33 LOCKUP SRC reset source
ISR_HANDLER2 PWM2_FAULT                           // vPWM2_FAULT_IRQHandler                            - PWM2 fault or reload error interrupt
ISR_HANDLER2 PWM2_0                               // vPWM2_0_IRQHandler                                - PWM2 capture 0, compare 0, or reload 0 interrupt
ISR_HANDLER2 PWM2_1                               // vPWM2_1_IRQHandler                                - PWM2 capture 1, compare 1, or reload 1 interrupt
ISR_HANDLER2 PWM2_2                               // vPWM2_2_IRQHandler                                - PWM2 capture 2, compare 2, or reload 2 interrupt
ISR_HANDLER2 PWM2_3                               // vPWM2_3_IRQHandler                                - PWM2 capture 3, compare 3, or reload 3 interrupt
ISR_HANDLER2 PWM3_FAULT                           // vPWM3_FAULT_IRQHandler                            - PWM3 fault or reload error interrupt
ISR_HANDLER2 PWM3_0                               // vPWM3_0_IRQHandler                                - PWM3 capture 0, compare 0, or reload 0 interrupt
ISR_HANDLER2 PWM3_1                               // vPWM3_1_IRQHandler                                - PWM3 capture 1, compare 1, or reload 1 interrupt
ISR_HANDLER2 PWM3_2                               // vPWM3_2_IRQHandler                                - PWM3 capture 2, compare 2, or reload 2 interrupt
ISR_HANDLER2 PWM3_3                               // vPWM3_3_IRQHandler                                - PWM3 capture 3, compare 3, or reload 3 interrupt
ISR_HANDLER2 PWM4_FAULT                           // vPWM4_FAULT_IRQHandler                            - PWM4 fault or reload error interrupt
ISR_HANDLER2 PWM4_0                               // vPWM4_0_IRQHandler                                - PWM4 capture 0, compare 0, or reload 0 interrupt
ISR_HANDLER2 PWM4_1                               // vPWM4_1_IRQHandler                                - PWM4 capture 1, compare 1, or reload 1 interrupt
ISR_HANDLER2 PWM4_2                               // vPWM4_2_IRQHandler                                - PWM4 capture 2, compare 2, or reload 2 interrupt
ISR_HANDLER2 PWM4_3                               // vPWM4_3_IRQHandler                                - PWM4 capture 3, compare 3, or reload 3 interrupt
ISR_HANDLER2 EQDC1                                // vEQDC1_IRQHandler                                 - EQDC1 interrupt
ISR_HANDLER2 EQDC2                                // vEQDC2_IRQHandler                                 - EQDC2 interrupt
ISR_HANDLER2 EQDC3                                // vEQDC3_IRQHandler                                 - EQDC3 interrupt
ISR_HANDLER2 EQDC4                                // vEQDC4_IRQHandler                                 - EQDC4 interrupt
ISR_HANDLER2 ADC2                                 // vADC2_IRQHandler                                  - ADC2 interrupt
ISR_HANDLER2 DCDC                                 // vDCDC_IRQHandler                                  - DCDC brown out interrupt
ISR_HANDLER2 CAN3                                 // vCAN3_IRQHandler                                  - CAN3 interrupt
ISR_HANDLER2 CAN3_ERROR                           // vCAN3_ERROR_IRQHandler                            - CAN3 error interrupt
ISR_HANDLER2 DAC                                  // vDAC_IRQHandler                                   - DAC interrupt
ISR_HANDLER2 LPSPI5                               // vLPSPI5_IRQHandler                                - LPSPI5 interrupt
ISR_HANDLER2 LPSPI6                               // vLPSPI6_IRQHandler                                - LPSPI6 interrupt
ISR_HANDLER2 LPUART7                              // vLPUART7_IRQHandler                               - LPUART7 interrupt
ISR_HANDLER2 LPUART8                              // vLPUART8_IRQHandler                               - LPUART8 interrupt
ISR_HANDLER2 SAI2                                 // vSAI2_IRQHandler                                  - SAI2 interrupt
ISR_RESERVED                                      // vReserved215_IRQHandler                           - Reserved interrupt
ISR_RESERVED                                      // vReserved216_IRQHandler                           - Reserved interrupt
ISR_RESERVED                                      // vReserved217_IRQHandler                           - Reserved interrupt
ISR_HANDLER2 ACMP3                                // vACMP3_IRQHandler                                 - CMP3 interrupt
ISR_RESERVED                                      // vReserved219_IRQHandler                           - Reserved interrupt
ISR_HANDLER2 CM7_PS                               // vCM7_PS_IRQHandler                                - M7 PS Tag/Data Parity Error
ISR_HANDLER2 CM7_MCM                              // vCM7_MCM_IRQHandler                               - M7 MCM interrupt
ISR_HANDLER2 CM33_MCM                             // vCM33_MCM_IRQHandler                              - M33 MCM interrupt
ISR_RESERVED                                      // Reserved223_IRQHandler                              - Reserved interrupt
ISR_HANDLER2 SAFETY_CLK_MON                       // vSAFETY_CLK_MON_IRQHandler                        - Safety clock monitor interrupt
ISR_HANDLER2 GPT1                                 // vGPT1_IRQHandler                                  - GPT1 interrupt
ISR_HANDLER2 GPT2                                 // vGPT2_IRQHandler                                  - GPT2 interrupt
ISR_HANDLER2 KPP                                  // vKPP_IRQHandler                                   - KPP interrupt
ISR_HANDLER2 USBPHY1                              // vUSBPHY1_IRQHandler                               - USBPHY1 interrupt
ISR_RESERVED                                      // vReserved229_IRQHandler                           - Reserved interrupt
ISR_RESERVED                                      // vReserved230_IRQHandler                           - Reserved interrupt
ISR_HANDLER2 USB_OTG1                             // vUSB_OTG1_IRQHandler                              - USBOTG1 interrupt
ISR_HANDLER2 FLEXSPI_SLV                          // vFLEXSPI_SLV_IRQHandler                           - FLEXSPI follower interrupt
ISR_HANDLER2 NETC                                 // vNETC_IRQHandler                                  - NETC interrupt
ISR_HANDLER2 MSGINTR1                             // vMSGINTR1_IRQHandler                              - MSGINTR1 interrupt
ISR_HANDLER2 MSGINTR2                             // vMSGINTR2_IRQHandler                              - MSGINTR2 interrupt
ISR_HANDLER2 MSGINTR3                             // vMSGINTR3_IRQHandler                              - MSGINTR3 interrupt
ISR_HANDLER2 MSGINTR4                             // vMSGINTR4_IRQHandler                              - MSGINTR4 interrupt
ISR_HANDLER2 MSGINTR5                             // vMSGINTR5_IRQHandler                              - MSGINTR5 interrupt
ISR_HANDLER2 MSGINTR6                             // vMSGINTR6_IRQHandler                              - MSGINTR6 interrupt
ISR_HANDLER2 SINC1_CH0                            // vSINC1_CH0_IRQHandler                             - SINC Filter Glue 1 channel 0
ISR_HANDLER2 SINC1_CH1                            // vSINC1_CH1_IRQHandler                             - SINC Filter Glue 1 channel 1
ISR_HANDLER2 SINC1_CH2                            // vSINC1_CH2_IRQHandler                             - SINC Filter Glue 1 channel 2
ISR_HANDLER2 SINC1_CH3                            // vSINC1_CH3_IRQHandler                             - SINC Filter Glue 1 channel 3
ISR_HANDLER2 SINC2_CH0                            // vSINC2_CH0_IRQHandler                             - SINC Filter Glue 2 channel 0
ISR_HANDLER2 SINC2_CH1                            // vSINC2_CH1_IRQHandler                             - SINC Filter Glue 2 channel 1
ISR_HANDLER2 SINC2_CH2                            // vSINC2_CH2_IRQHandler                             - SINC Filter Glue 2 channel 2
ISR_HANDLER2 SINC2_CH3                            // vSINC2_CH3_IRQHandler                             - SINC Filter Glue 2 channel 3
ISR_HANDLER2 GPIO4                                // vGPIO4_IRQHandler                                 - GPIO4 interrupt
ISR_HANDLER2 TMR2                                 // vTMR2_IRQHandler                                  - TMR2 interrupt
ISR_HANDLER2 GPIO5                                // vGPIO5_IRQHandler                                 - GPIO5 interrupt
ISR_HANDLER2 ASRC                                 // vASRC_IRQHandler                                  - ASRC interrupt
ISR_HANDLER2 GPIO6                                // vGPIO6_IRQHandler                                 - GPIO6 interrupt
ISR_HANDLER2 DBG_TRACE                            // vDBG_TRACE_IRQHandler                             - JTAGSW DAP MDM-AP SRC reset source
ISR_RESERVED                                      // Reserved254_IRQHandler                          - Reserved interrupt
.long 0xFFFFFFFF                                  //  Reserved for user TRIM value

  .section .vectors, "ax"
_vectors_end:

#if defined VECTORS_IN_RAM && defined XIP_EXTERNAL_FLASH
  .section .vectors_ram, "ax"
_vectors_ram:
  .space _vectors_end-_vectors, 0
#endif

